src/app/shared/mocks/GetDisputeHistory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:GetDisputeStatus>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:RequestKey>BC-87c32ec7-7803-4e70-94c8-bfa64b2d3ac4</data:RequestKey>
        <data:EnrollmentKey>e62b9e16-dac9-47ff-8fa0-d029b622d59d</data:EnrollmentKey>
      </con:request>
    </con:GetDisputeStatus>
  </soapenv:Body>
</soapenv:Envelope>